Ran Plan for 2 projects:

1. dir: `infrastructure/core/vpc` workspace: `default`
1. dir: `infrastructure/core/eks` workspace: `default`

### 1. dir: `infrastructure/core/vpc` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/core/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-dev.dev.appcd.io/lock?id=appcd-dev%252FDogeAPI%252Finfrastructure%252Fcore%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/core/vpc`

---
### 2. dir: `infrastructure/core/eks` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.6 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/appcd-dev/DogeAPI/1/default/infrastructure/core/eks/default.tfplan\"" in "/home/atlantis/.atlantis/repos/appcd-dev/DogeAPI/1/default/infrastructure/core/eks": exit status 1
data.terraform_remote_state.vpc: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=368945481389]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=368945481389]
module.eks.data.aws_iam_session_context.current: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/demo-demo/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "demo"
          + "Name"        = "/aws/eks/demo-demo/cluster"
          + "Terraform"   = "True"
        }
      + tags_all          = {
          + "Environment" = "demo"
          + "Name"        = "/aws/eks/demo-demo/cluster"
          + "Terraform"   = "True"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "demo-demo-cluster-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "demo-demo-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn  = "module.eks.cluster_arn"
  + cluster_name = "module.eks.cluster_name"
╷
│ Error: AccessDenied: Access Denied
│ 	status code: 403, request id: DW7S815D5RGNAYKE, host id: buQ+wL3ILMwa3UA0AUigRGIgWnpuXQcOKIq5WdFCawgOwA1fxvZr7LN2pSHNcA29a2C00gPqXx4=
│ 
│ 
╵
╷
│ Error: unable to get role (atlantis-dev-ecs_task_execution): AccessDenied: User: arn:aws:sts::368945481389:assumed-role/atlantis-dev-ecs_task_execution/c7c99151337c4d59bd28c460e2bdc92c is not authorized to perform: iam:GetRole on resource: role atlantis-dev-ecs_task_execution because no identity-based policy allows the iam:GetRole action
│ 	status code: 403, request id: b7f519d7-bebe-45f3-8fd9-126e6fb5643f
│ 
│   with module.eks.data.aws_iam_session_context.current,
│   on .terraform/modules/eks/main.tf line 4, in data "aws_iam_session_context" "current":
│    4: data "aws_iam_session_context" "current" {
│ 
╵

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`